[
    {
        "id": 4,
        "year": "2024",
        "yearRange": "2024 - Present",
        "name": "Self Employed",
        "roles": [
            {
                "title": "Full Stack Engineer",
                "description": "Collaborated with clients to design, develop, and deploy custom web applications. Focused on creating responsive front-end interfaces and robust back-end solutions to meet diverse client needs. Successfully managed multiple projects from inception to launch, ensuring client satisfaction through high-quality standards and effective communication."
            }
        ],
        "skills": [
            "React Native", 
            "React", 
            "Next", 
            "Node", 
            "JavaScript", 
            "TypeScript",
            "MongoDB"
        ]
    },
    {
        "id": 3,
        "year": "2023",
        "yearRange": "2023 - 2025",
        "name": "Reflectica AI",
        "roles": [
            {
                "title": "Software Engineer",
                "description": "Served as a lead developer for the enhancement of a psychotherapy platform, focusing on improving functionality and user experience. Spearheaded the development of a full-stack web application, optimizing performance and overseeing the product lifecycle to uphold high-quality standards."
            },
            {
                "title": "Software Engineer Intern",
                "description": "Supported the development team in testing, troubleshooting, and refining the psychotherapy platform. Played a key role in collaborative efforts to enhance platform stability and functionality."
            }
        ],
        "skills": ["React Native", "React", "Firebase", "Node", "JavaScript", "Next", "TypeScript"]
    },
    {
        "id": 2,
        "year": "2023",
        "yearRange": "2023 - 2024",
        "name": "CodeRev Kids",
        "roles": [
            {
                "title": "Coding Instructor",
                "description": "Educated students in programming fundamentals and video game development, employing interactive tools and methodologies to foster engagement and learning. Introduced innovative hands-on learning experiences to enhance coding proficiency and stimulate interest in technology."
            }
        ],
        "skills": ["Arduino", "Scratch"]
    },
    {
        "id": 1,
        "year":"2023",
        "yearRange": "2023 - 2024",
        "name": "edX",
        "roles": [
            {
                "title": "Learning Assistant",
                "description": "Provided comprehensive support to students, facilitating a collaborative online learning environment. Adapted teaching methods to meet diverse student needs, contributing to a supportive community and enhancing student engagement."
            },
            {
                "title": "Teaching Assistant", 
                "description": "Played a vital role in the delivery of online educational content, offering timely assistance and feedback to students. Engaged in the creation and refinement of course materials, ensuring educational quality and accessibility."
            }
        ],
        "skills": ["React", "MongoDB", "MySQL", "JavaScript", "NoSQL", "GraphQL", "jQuery", "Express", "Heroku", "Netlify", "Git"]
    }
]